app/views/element_types/show.html.haml

SELECT `elements`.* FROM `elements` WHERE `elements`.`element_type_id` = 334
---
%ul
  - @element_type.elements.each do |ele|