app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 4 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1
---
  def edit
    @document = Document.find(params[:id])
    @site = Site.find(params[:site_id])

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 13 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1
---
  def update
    @document = Document.find(params[:id])
    @site = Site.find(params[:site_id])

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 16 LIMIT 1
DELETE FROM `documents` WHERE `documents`.`id` = 16
---
  def destroy
    @document = Document.find(params[:id])
    @document.destroy