app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
  def show
    @document = Document.find(params[:id])
    @site = Site.find(params[:site_id])

SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
  def new
    @document = Document.new
    @version = Version.new
    @document.active_version = @version
    @document.versions << @version
    @site = Site.find(params[:site_id])

SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
INSERT INTO `documents` (`content`, `created_at`, `site_id`, `updated_at`) VALUES ('Type: Recycling\nLayer: State\nVariation: 2\n*/\nHEADER: A second recycling header.\nBODY: Recycling sentence one, again. A second sentence about\nrecycling, i think. A third sentence about recycling. A fouth sentence about \nrecycling.\nCTA: A call to action - important.\nBODY: Recycling sentence* onesise. A second sentence about\nrecycling. A third sentence about recycling?* A follow up sentence\nFOOTER: Some sort of footer\nCTA2: A second call to action\n', '2011-07-30 05:24:10', NULL, '2011-07-30 05:24:10')
---
  def create
    @site = Site.find(params[:site_id])
    @document = @site.documents.build
    @version = @document.versions.build(params[:document][:active_version])
    @document.active_version = @version
    respond_to do |format|
      if @site.save