app/controllers/elements_controller.rb

  def index
    @site = Site.find(params[:site_id])
    @elements = []
    @element_types = ElementType.where(:site_id => params[:site_id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 3 LIMIT 1
SELECT `element_types`.* FROM `element_types` WHERE `element_types`.`site_id` = 3 LIMIT 1