app/controllers/element_types_controller.rb

  def index
    @site = Site.find(params[:site_id])
    @element_types = ElementType.where(:site_id => @site.id)
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1
SELECT `element_types`.* FROM `element_types` WHERE `element_types`.`site_id` = 2 LIMIT 1

  def show
    @site = Site.find(params[:site_id])
    @element_type = ElementType.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1
SELECT `element_types`.* FROM `element_types` WHERE `element_types`.`id` = 334 LIMIT 1

  def destroy
    @site = Site.find(params[:site_id])
    @element_type = ElementType.find(params[:id])
    @element_type.destroy
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 3 LIMIT 1
SELECT `element_types`.* FROM `element_types` WHERE `element_types`.`id` = 517 LIMIT 1
DELETE FROM `element_types` WHERE `element_types`.`id` = 517
DELETE FROM `elements` WHERE `elements`.`id` = 989