app/controllers/sites_controller.rb

  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save
---
INSERT INTO `sites` (`created_at`, `name`, `updated_at`, `url`) VALUES ('2011-08-29 14:46:42', 'Sikkens', '2011-08-29 14:46:42', 'local.sikkens.ca')

  def export_csv
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 2 LIMIT 1