app/controllers/sites_controller.rb

  def index
    @sites = Site.all
---
SELECT `sites`.* FROM `sites`

  def show
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1

  def compile_documents
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 3 LIMIT 1