app/views/sites/show.html.haml

SELECT `documents`.* FROM `documents` WHERE `documents`.`site_id` = 27
---

- if @site.documents.size > 0