app/views/sites/show.html.haml

SELECT COUNT(*) FROM `element_types` WHERE `element_types`.`site_id` = 2
---

- if @site.element_types.size > 0

SELECT COUNT(*) FROM `documents` WHERE `documents`.`site_id` = 3
---

- if @site.documents.size > 0